# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
# tap 'nicoverbruggen/homebrew-cask'
# tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
# brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
# brew 'grep'
# brew 'httpie'
# brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
# brew 'stripe/stripe-cli/stripe'
# brew 'stripe/stripe-mock/stripe-mock'
# brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
# brew 'php'
# brew 'php@8.0'
# brew 'php@7.4'
# brew 'composer'
brew 'imagemagick'
# brew 'meilisearch'
# brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'pnpm'

# Apps
# cask '1password'
# cask 'caffeine'
# cask 'dbngin'
# cask 'tinkerwell'
# cask 'transmit'
# cask 'tunnelbear'
# cask 'tuple'
# cask 'firefox'
# cask 'helo'
# cask 'imageoptim'
# cask 'insomnia'
# cask 'pastebot'
# cask 'phpmon'
# cask 'ray'
# cask 'screenflow'
# cask 'tableplus'

cask 'figma'
cask 'the-unarchiver'
cask 'zoom'
cask 'setapp' # apps
cask 'spotify' # music
cask 'bitwarden' # passwords
cask 'mimestream' # email
cask 'blender' # 3d
cask 'internxt-drive' # storage

# browsers
cask 'microsoft-edge'
cask 'brave-browser'
cask 'google-chrome'
cask 'orion'

# productivity
cask 'raycast' # alfred
cask 'obsidian' # PKM
cask 'toggl-track'
cask 'raindropio' # bookmarks
cask 'mem' # obsidian
cask 'agenda' # daily notes

# messengers
cask 'telegram-desktop'
cask 'whatsapp'
cask 'slack'
cask 'discord'

# dev
cask 'docker'
cask 'github'
cask 'visual-studio-code'
cask 'iterm2'
cask 'fig'
cask 'mongodb-compass'

# Quicklook
# cask 'qlmarkdown'
# cask 'quicklook-json'

# Fonts
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# Mac App Store
# mas 'Byword', id: 420212497
# mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas 'Spark', id: 1176895641
# mas 'Speedtest', id: 1153157709
# mas 'Things', id: 904280696
# mas 'Tweetbot', id: 1384080005
